brew "exiftool"
brew "ffmpeg"
brew "gist"
brew "git"
brew "git-extras"
brew "hub"
brew "imagemagick"
brew "jq"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "kubernetes-helm"
cask "lastpass"
cask "evernote"
cask "handbrake"
cask "iina"
cask "iterm2"
cask "postman"
cask "slack"
cask "visual-studio-code"
tap "caskroom/fonts"
cask "font-hack-nerd-font"
cask "font-profont-nerd-font"
cask "font-ubuntumono-nerd-font"
cask "spotify"
