# Taps
tap "romkatv/powerlevel10k"

# Shell and Terminal
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "git"
brew "git-extras"
brew "jq"
cask "wezterm"

# Fonts
cask "font-meslo-lg-nerd-font"

# Development Tools
brew "fnm"     # Fast Node Manager
brew "pnpm"    # Fast Node Package Manager
cask "visual-studio-code"
cask "dbeaver-community"

# Python Tools
brew "python"
brew "poetry"
brew "pyenv"   # Python version manager

# Rust Tools
brew "rust"
brew "cargo-edit"    # Cargo subcommands for dependency management

# Container Tools
brew "podman"
brew "podman-compose"

# Java (SDKman will be installed via script, not brew)

# Applications
cask "firecamp"    # API Testing Tool
cask "slack"
cask "spotify"

# Additional Dependencies
brew "cmake"       # Required for some build processes
brew "pkg-config"  # Required for some build processes
brew "openssl"     # Required for various tools
brew "readline"    # Required for various tools
brew "sqlite3"     # Required for various tools
brew "xz"          # Required for various tools
brew "zlib"        # Required for various tools