# Taps
tap "romkatv/powerlevel10k"
tap "weaveworks/tap"
tap "hashicorp/tap"    # Official HashiCorp formulae (Terraform moved here after the BSL license change)

# Shell and Terminal
brew "bash"
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "git"
brew "git-extras"
brew "gh"
brew "jq"
brew "tmux"
cask "ghostty"

# Fonts
cask "font-meslo-lg-nerd-font"

# Development Tools
brew "fnm"     # Fast Node Manager
brew "pnpm"    # Fast Node Package Manager
cask "visual-studio-code"
cask "claude"                  # Claude desktop app
cask "dbeaver-community"

# Python Tools
brew "python"
brew "poetry"
brew "pyenv"   # Python version manager

# Rust Tools
brew "rust"
brew "cargo-edit"    # Cargo subcommands for dependency management

# Container Tools
brew "podman"
brew "podman-compose"

# Java (SDKman will be installed via script, not brew)

# Applications
cask "firecamp"    # API Testing Tool
cask "tailscale"
cask "slack"
cask "spotify"

# Additional Dependencies
brew "cmake"       # Required for some build processes
brew "pkg-config"  # Required for some build processes
brew "openssl"     # Required for various tools
brew "readline"    # Required for various tools
brew "sqlite3"     # Required for various tools
brew "xz"          # Required for various tools
brew "zlib"        # Required for various tools
brew "awscli"
brew "weaveworks/tap/eksctl"

# Infrastructure as Code
brew "hashicorp/tap/terraform"    # Terraform (HashiCorp tap; homebrew-core no longer ships it)
brew "terraform-ls"               # Terraform language server (editor LSP support)
brew "tflint"                     # Terraform linter